import React from 'react';
import {TfiClose} from "react-icons/tfi";
import Common from "../common/Common";

const MentorsChat = () => {
    return (
        <div>정당은 법률이 정하는 바에 의하여 국가의 보호를 받으며, 국가는 법률이 정하는 바에 의하여 정당운영에 필요한 자금을 보조할 수 있다. 대통령은 국무회의의 의장이 되고, 국무총리는 부의장이
            된다.

            대통령은 국민의 보통·평등·직접·비밀선거에 의하여 선출한다. 저작자·발명가·과학기술자와 예술가의 권리는 법률로써 보호한다. 모든 국민은 그 보호하는 자녀에게 적어도 초등교육과 법률이 정하는
            교육을 받게 할 의무를 진다.

            국회는 헌법개정안이 공고된 날로부터 60일 이내에 의결하여야 하며, 국회의 의결은 재적의원 3분의 2 이상의 찬성을 얻어야 한다. 모든 국민은 능력에 따라 균등하게 교육을 받을 권리를 가진다.

            공무원의 신분과 정치적 중립성은 법률이 정하는 바에 의하여 보장된다. 국회의원은 국가이익을 우선하여 양심에 따라 직무를 행한다. 국군의 조직과 편성은 법률로 정한다.

            누구든지 병역의무의 이행으로 인하여 불이익한 처우를 받지 아니한다. 국민경제자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다. 국회의 회의는 공개한다. 다만, 출석의원 과반수의 찬성이
            있거나 의장이 국가의 안전보장을 위하여 필요하다고 인정할 때에는 공개하지 아니할 수 있다.

            재판의 심리와 판결은 공개한다. 다만, 심리는 국가의 안전보장 또는 안녕질서를 방해하거나 선량한 풍속을 해할 염려가 있을 때에는 법원의 결정으로 공개하지 아니할 수 있다.

            국군은 국가의 안전보장과 국토방위의 신성한 의무를 수행함을 사명으로 하며, 그 정치적 중립성은 준수된다. 누구든지 체포 또는 구속의 이유와 변호인의 조력을 받을 권리가 있음을 고지받지 아니하고는
            체포 또는 구속을 당하지 아니한다. 체포 또는 구속을 당한 자의 가족등 법률이 정하는 자에게는 그 이유와 일시·장소가 지체없이 통지되어야 한다.</div>


    )
        ;
};

export default MentorsChat;